# Importando base de datos

In [1]:
import pandas as pd

In [2]:
pd.read_csv("Data-Visualization-Explorando-con-Seaborn-aula1/credit_card.csv")

,LIMIT_BAL,CHECKING_ACCOUNT,EDUCATION,MARRIAGE,AGE,BILL_AMT,PAY_AMT,DEFAULT
0,6022,Yes,2.University,Married,24,934.0122,0.0000,1
1,36132,Yes,2.University,Single,26,519.3975,0.0000,1
2,27099,Yes,2.University,Single,34,4223.5297,457.0698,0
3,15055,Yes,2.University,Married,37,14522.9563,602.2000,0
4,150550,No,3.Graduate School,Single,29,124060.1253,16560.5000,0
...,...,...,...,...,...,...,...,...
1495,54198,Yes,3.Graduate School,Single,27,295.0780,0.0000,1
1496,45165,No,2.University,Married,55,23637.8555,1144.1800,0
1497,78286,No,3.Graduate School,Single,34,962.9178,962.9178,0
1498,6022,No,2.University,Married,44,864.7592,864.7592,0
1499,183671,No,3.Graduate School,Single,31,97022.8508,97022.8508,0

In [3]:
datos = pd.read_csv("Data-Visualization-Explorando-con-Seaborn-aula1/credit_card.csv")

In [6]:
datos.head(10)

,LIMIT_BAL,CHECKING_ACCOUNT,EDUCATION,MARRIAGE,AGE,BILL_AMT,PAY_AMT,DEFAULT
0,6022,Yes,2.University,Married,24,934.0122,0.0000,1
1,36132,Yes,2.University,Single,26,519.3975,0.0000,1
2,27099,Yes,2.University,Single,34,4223.5297,457.0698,0
3,15055,Yes,2.University,Married,37,14522.9563,602.2000,0
4,150550,No,3.Graduate School,Single,29,124060.1253,16560.5000,0
5,30110,Yes,2.University,Single,23,114.4180,114.4180,0
6,42154,Yes,1.High School,Married,28,4244.3056,1002.3619,0
7,60220,Yes,1.High School,Single,34,2946.8657,694.3366,0
8,78286,Yes,3.Graduate School,Single,51,6524.8370,6524.8370,0
9,189693,Yes,2.University,Single,41,1957.1500,301.1000,0

In [7]:
datos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   LIMIT_BAL         1500 non-null   int64
 1   CHECKING_ACCOUNT  1500 non-null   object
 2   EDUCATION         1500 non-null   object
 3   MARRIAGE          1500 non-null   object
 4   AGE               1500 non-null   int64
 5   BILL_AMT          1500 non-null   float64
 6   PAY_AMT           1500 non-null   float64
 7   DEFAULT           1500 non-null   int64
dtypes: float64(2), int64(3), object(3)
memory usage: 93.9+ KB

# Traduciendo Variables

In [8]:
datos.columns

Index(['LIMIT_BAL', 'CHECKING_ACCOUNT', 'EDUCATION', 'MARRIAGE', 'AGE',
       'BILL_AMT', 'PAY_AMT', 'DEFAULT'],
      dtype='object')

In [10]:
dic_columnas = {
    'LIMIT_BAL': 'limite', 
    'CHECKING_ACCOUNT':'cuenta_corriente', 
    'EDUCATION':'escolaridad', 
    'MARRIAGE':'estado_civil', 
    'AGE':'edad',
    'BILL_AMT':'valor_factura', 
    'PAY_AMT':'valor_pago', 
    'DEFAULT':'moroso'
}

In [12]:
tarjetas = datos.rename(columns=dic_columnas)

In [13]:
tarjetas.head()

,limite,cuenta_corriente,escolaridad,estado_civil,edad,valor_factura,valor_pago,moroso
0,6022,Yes,2.University,Married,24,934.0122,0.0000,1
1,36132,Yes,2.University,Single,26,519.3975,0.0000,1
2,27099,Yes,2.University,Single,34,4223.5297,457.0698,0
3,15055,Yes,2.University,Married,37,14522.9563,602.2000,0
4,150550,No,3.Graduate School,Single,29,124060.1253,16560.5000,0

In [14]:
tarjetas.cuenta_corriente.unique()

array(['Yes', 'No'], dtype=object)

In [16]:
dic_cuenta = {
   'Yes':'si', 
   'No':'No' 
}

In [17]:
tarjetas.cuenta_corriente.map(dic_cuenta)

0       si
1       si
2       si
3       si
4       No
        ..
1495    si
1496    No
1497    No
1498    No
1499    No
Name: cuenta_corriente, Length: 1500, dtype: object

In [18]:
tarjetas.head()

,limite,cuenta_corriente,escolaridad,estado_civil,edad,valor_factura,valor_pago,moroso
0,6022,Yes,2.University,Married,24,934.0122,0.0000,1
1,36132,Yes,2.University,Single,26,519.3975,0.0000,1
2,27099,Yes,2.University,Single,34,4223.5297,457.0698,0
3,15055,Yes,2.University,Married,37,14522.9563,602.2000,0
4,150550,No,3.Graduate School,Single,29,124060.1253,16560.5000,0

In [19]:
tarjetas.cuenta_corriente = tarjetas.cuenta_corriente.map(dic_cuenta)

In [20]:
tarjetas.head()

,limite,cuenta_corriente,escolaridad,estado_civil,edad,valor_factura,valor_pago,moroso
0,6022,si,2.University,Married,24,934.0122,0.0000,1
1,36132,si,2.University,Single,26,519.3975,0.0000,1
2,27099,si,2.University,Single,34,4223.5297,457.0698,0
3,15055,si,2.University,Married,37,14522.9563,602.2000,0
4,150550,No,3.Graduate School,Single,29,124060.1253,16560.5000,0

In [21]:
tarjetas.escolaridad.unique()

array(['2.University', '3.Graduate School', '1.High School'], dtype=object)

In [27]:
dic_escolaridad = {
    '2.University':'2.Universida', 
    '3.Graduate School':'3.Pos-graduacion', 
    '1.High School':'1.colegio'
}

In [28]:
tarjetas.escolaridad = tarjetas.escolaridad.map(dic_escolaridad)

In [29]:
tarjetas.head()

,limite,cuenta_corriente,escolaridad,estado_civil,edad,valor_factura,valor_pago,moroso
0,6022,si,NaN,Married,24,934.0122,0.0000,1
1,36132,si,NaN,Single,26,519.3975,0.0000,1
2,27099,si,NaN,Single,34,4223.5297,457.0698,0
3,15055,si,NaN,Married,37,14522.9563,602.2000,0
4,150550,No,NaN,Single,29,124060.1253,16560.5000,0

In [30]:
tarjetas.estado_civil.unique()

array(['Married', 'Single'], dtype=object)

In [31]:
dic_estado_civil = {
    'Married':'Casado/a', 
    'Single':'Soltero/a'
}

In [32]:
tarjetas.estado_civil = tarjetas.estado_civil.map(dic_estado_civil)

In [33]:
tarjetas.head()

,limite,cuenta_corriente,escolaridad,estado_civil,edad,valor_factura,valor_pago,moroso
0,6022,si,NaN,Casado/a,24,934.0122,0.0000,1
1,36132,si,NaN,Soltero/a,26,519.3975,0.0000,1
2,27099,si,NaN,Soltero/a,34,4223.5297,457.0698,0
3,15055,si,NaN,Casado/a,37,14522.9563,602.2000,0
4,150550,No,NaN,Soltero/a,29,124060.1253,16560.5000,0